package main

import "fmt"

func testFloat() {
	testFloat1()
	testFloat2()
	testFloat3()
	testFloat4()
	testFloat5()

}

/*
Найти площадь круга заданного радиуса 𝑅.

В качестве значения числа 𝜋 использовать 3.14. Для нахождения площади круга существует формула 𝑆=𝜋⋅𝑅^2

Формат входных данных
На вход подается положительное вещественное число 𝑅
R - радиус круга, не превышающее 1000.

Формат выходных данных
Программа должна вывести площадь круга радиуса  𝑅.
*/
func testFloat1() {
	var R float64
	fmt.Scan(&R)
	pi := 3.14
	S := pi * R * R
	fmt.Println(S)
}

/*
Напишите программу, которая считывает длины двух катетов в прямоугольном треугольнике и выводит его площадь.

Формат входных данных
На вход программе подаётся два вещественных числа
𝑎 и 𝑏 – длины катетов, каждое на отдельной строке.

Формат выходных данных
Программа должна вывести одно число – площадь треугольника.
*/
func testFloat2() {
	var a, b float64
	fmt.Scan(&a, &b)
	S := (a * b) / 2
	fmt.Println(S)
}

/*
Напишите программу, которая определяет, какой температуре по шкале Цельсия соответствует указанное значение по шкале Фаренгейта.

Используйте формулу для перевода: (F – 32) × 5/9

Формат входных данных
На вход программе подаётся вещественное число F градусов по шкале Фаренгейта.

Формат выходных данных
Программа должна вывести число градусов по шкале Цельсия.
*/
func testFloat3() {
	var F float64
	fmt.Scan(&F)
	t := (F - 32) * 5 / 9
	fmt.Println(t)
}

/*
Даны два числа. Найти их среднее арифметическое.

Формат входных данных
На вход дается два целых положительных числа 𝑎 и 𝑏, каждое из которых не превышает
10000.

Формат выходных данных
Программа должна вывести среднее арифметическое чисел
𝑎 и 𝑏.
*/
func testFloat4() {
	var a, b int
	fmt.Scan(&a, &b)
	S := float32(a+b) / 2
	fmt.Print(float32(S))
}

/*
Дано положительное вещественное число 𝑥. Выведите его дробную часть.

Входные данные
Вводится положительное вещественное число.

Выходные данные
Дробная часть входного числа.
*/
func testFloat5() {
	var x float32
	fmt.Scan(&x)
	c := x - float32(int(x))
	fmt.Println(c)
}
