package main

import (
	"fmt"
	"math"
)

func testIf() {
	testIf1()
	testIf2()
	testIf3()
	testIf4()
	testIf5()
	testIf6()
	testIf7()
	testIf8()
	testIf9()
	testIf10()
	testIf11()
	testIf12()
	testIf13()
	testIf14()
	testIf15()
	testIf16()
	testIf17()
	testIf18()
	testIf19()
	testIf20()
	testIf21()
	testIf22()
	testIf23()
	testIf24()

}

/*
Богач или бедняк?
На вход подается целое число, сумма денег, которые у вас есть. Ваша задача - вывести марку телефона, которую вы можете себе позволить купить.

Если сумма больше 1000 - вывести Apple
Если сумма от 500 до 1000 (включительно) - вывести Samsung
Если сумма меньше 500 - вывести Nokia с фонариком
*/
func testIf1() {
	var a int
	fmt.Scan(&a)
	if a > 1000 {
		fmt.Println("Apple")
	} else if a >= 500 && a <= 1000 {
		fmt.Println("Samsung")
	} else {
		fmt.Println("Nokia с фонариком")
	}
}

/*
Давайте исправим еще одну программу. Нам нужно, чтобы получился правильный оператор if...else if...else, который проверяет переменную height и если она больше 185,
должен выводиться текст Высокий рост, если она в пределах от 170 до 185 (включительно), должен выводить текст Средний рост,
а если ее значение меньше 170 - текст Небольшой рост
*/
func testIf2() {
	var height int
	fmt.Scan(&height)
	if height > 185 {
		fmt.Println("Высокий рост")
	} else if height >= 170 && height <= 185 {
		fmt.Println("Средний рост")
	} else {
		fmt.Println("Небольшой рост")
	}
}

/*
Вы создаете робота, который может говорить числа.
Ваш робот должен принимать на вход 3 целых числа (каждое с новой строки) в диапазоне от 0 до 10 (включительно) и выдавать соответствующий текст на русском языке.
*/
func testIf3() {
	var a, b, c int
	fmt.Scan(&a, &b, &c)
	switch a {
	case 0:
		fmt.Println("Ноль")
	case 1:
		fmt.Println("Один")
	case 2:
		fmt.Println("Два")
	case 3:
		fmt.Println("Три")
	case 4:
		fmt.Println("Четыре")
	case 5:
		fmt.Println("Пять")
	case 6:
		fmt.Println("Шесть")
	case 7:
		fmt.Println("Семь")
	case 8:
		fmt.Println("Восемь")
	case 9:
		fmt.Println("Девять")
	case 10:
		fmt.Println("Десять")
	default:
		fmt.Println(a)
	}
	switch b {
	case 0:
		fmt.Println("Ноль")
	case 1:
		fmt.Println("Один")
	case 2:
		fmt.Println("Два")
	case 3:
		fmt.Println("Три")
	case 4:
		fmt.Println("Четыре")
	case 5:
		fmt.Println("Пять")
	case 6:
		fmt.Println("Шесть")
	case 7:
		fmt.Println("Семь")
	case 8:
		fmt.Println("Восемь")
	case 9:
		fmt.Println("Девять")
	case 10:
		fmt.Println("Десять")
	default:
		fmt.Println(b)
	}
	switch c {
	case 0:
		fmt.Println("Ноль")
	case 1:
		fmt.Println("Один")
	case 2:
		fmt.Println("Два")
	case 3:
		fmt.Println("Три")
	case 4:
		fmt.Println("Четыре")
	case 5:
		fmt.Println("Пять")
	case 6:
		fmt.Println("Шесть")
	case 7:
		fmt.Println("Семь")
	case 8:
		fmt.Println("Восемь")
	case 9:
		fmt.Println("Девять")
	case 10:
		fmt.Println("Десять")
	default:
		fmt.Println(c)
	}
	// Тут у меня возник вопрос. А что будет делать программа когда у нас введут больше 10? Как нам этот момент учитывать?
	//Или раз в требованиях не было, значит этот момент мы не учитываем) Степик у меня принял такое решение
}

/*
Вывести максимальное из двух чисел. Если числа равны, вывести любое из них.

Формат входных данных
Даны два целых числа, каждое из которых не превышает 100000.

Формат выходных данных
Выведите максимальное из них.
*/
func testIf4() {
	var a, b int
	fmt.Scan(&a, &b)
	if a > b {
		fmt.Println(a)
	} else if a < b {
		fmt.Println(b)
	} else {
		fmt.Println(a)
	}
}

/*
При регистрации на сайтах требуется вводить пароль дважды. Это сделано для безопасности,
поскольку такой подход уменьшает возможность неверного ввода пароля.
Напишите программу, которая сравнивает пароль и его подтверждение. Если они совпадают,
то программа выводит: «Пароль принят», иначе: «Пароль не принят».

Формат входных данных
На вход программе подаются две строки.

Формат выходных данных
Программа должна вывести одну строку в соответствии с условием задачи.
*/
func testIf5() {
	var a, b string
	fmt.Scan(&a, &b)
	if b == a {
		fmt.Println("Пароль принят")
	} else if b != a {
		fmt.Println("Пароль не принят")
	}
}

/*
Напишите программу, которая определяет, разрешен пользователю доступ к курсам школы или нет.

Формат входных данных
На вход программе подаётся целое число — возраст пользователя.

Формат выходных данных
Программа должна вывести текст «Доступ разрешен» если возраст не менее 12 лет, и «Доступ запрещен» в противном случае.
*/
func testIf6() {
	var a int
	fmt.Scan(&a)
	if a >= 12 {
		fmt.Println("Доступ разрешен")
	} else {
		fmt.Println("Доступ запрещен")
	}
}

/*
Дается одно целое число. Определите, является ли число четным.

Формат входных данных
На вход подается одно целое число, по модулю не превышающее 10^7.

Формат выходных данных
Выведите "YES", если число четное, в противном случае — "NO".
*/
func testIf7() {
	var a int
	fmt.Scan(&a)
	b := a % 2
	if b == 0 {
		fmt.Println("YES")
	} else {
		fmt.Println("NO")
	}
}

/*
Проверить делится ли 𝑎 на 𝑏 нацело.

Формат входных данных
На вход подаются два целых числа
𝑎 и 𝑏, каждое из которых по модулю не превышает
10^6. Гарантируется что b не равна нулю.

Формат выходных данных
Выведите "YES", если
𝑎 делится на 𝑏 нацело, в противном случае — "NO".
*/
func testIf8() {
	var a, b int
	fmt.Scan(&a, &b)
	c := a % b
	if c == 0 {
		fmt.Println("YES")
	} else {
		fmt.Println("NO")
	}
}

/*
Говоря простым языком:
Если вводимое число меньше нуля, то выводим
−1;
Если число равно нулю, то выводим 0;
Если число больше нуля, то выводим 1.
*/
func testIf9() {
	var a int
	fmt.Scan(&a)
	if a > 0 {
		fmt.Println("1")
	} else if a == 0 {
		fmt.Println("0")
	} else if a < 0 {
		fmt.Println("-1")
	} else {
		fmt.Println(a)
	}
}

/*
Напишите программу, которая определяет, является ли заданное натуральное число трёхзначным.

Формат входных данных
На вход подается одно натуральное число.

Формат выходных данных
Выведите "YES", если все введенное число является трёхзначным, в противном случае - "NO".
*/
func testIf10() {
	var a int
	fmt.Scan(&a)
	if a >= 100 && a <= 999 {
		fmt.Println("YES")
	} else {
		fmt.Println("NO")
	}
}

/*
Напишите программу, которая принимает целое число x и определяет,
принадлежит ли данное число указанному промежутку. от -1 до 17

Формат входных данных
На вход программе подаётся целое число x.

Формат выходных данных
Программа должна вывести текст "Принадлежит" или "Не принадлежит" в соответствии с условием задачи.
*/
func testIf11() {
	var x int
	fmt.Scan(&x)
	if x > -1 && x < 17 {
		fmt.Println("Принадлежит")
	} else {
		fmt.Println("Не принадлежит")
	}
}

/*
Напишите программу, которая принимает целое число x и определяет,
принадлежит ли данное число указанным промежуткам. до -3, от 7

Формат входных данных
На вход программе подаётся целое число x.

Формат выходных данных
Программа должна вывести текст "Принадлежит" или "Не принадлежит" в соответствии с условием задачи.
*/
func testIf12() {
	var x int
	fmt.Scan(&x)
	if x <= -3 || x >= 7 {
		fmt.Println("Принадлежит")
	} else {
		fmt.Println("Не принадлежит")
	}
}

/*
	По данному трехзначному числу, определите все ли его цифры различны.

Формат входных данных
На вход подается одно натуральное трехзначное число.

Формат выходных данных
Выведите "YES", если все цифры числа различны, в противном случае - "NO".
*/
func testIf13() {
	var a int
	fmt.Scan(&a)
	b := a / 100
	c := (a % 100) / 10
	d := (a % 10)
	if b != c && c != d && d != b {
		fmt.Println("YES")
	} else {
		fmt.Println("NO")
	}
}

/*
Определите является ли билет счастливым. Счастливым считается билет,
если в шестизначном номере которого сумма первых трёх цифр совпадает
с суммой трёх последних.

Формат входных данных
На вход подается номер билета - одно шестизначное  число.

Формат выходных данных
Выведите "YES", если билет счастливый  , в противном случае - "NO".
*/
func testIf14() {
	var a int
	fmt.Scan(&a)
	b := a / 100000
	c := (a % 100000) / 10000
	d := (a % 10000) / 1000
	e := (a % 1000) / 100
	f := (a % 100) / 10
	g := (a % 10)
	S1 := b + c + d
	S2 := e + f + g
	if S1 == S2 {
		fmt.Println("YES")
	} else {
		fmt.Println("NO")
	}
}

/*
Напишите программу, которая определяет, является ли год с данным номером високосным. Если год является високосным, то выведите «YES», иначе выведите «NO».

Год является високосным, если его номер кратен 4, но не кратен 100,
или если он кратен 400.

Формат входных данных
На вход программе подаётся натуральное число.

Формат выходных данных
Программа должна вывести текст в соответствии с условием задачи.
*/
func testIf15() {
	var a int
	fmt.Scan(&a)
	b := a % 4
	c := a % 100
	d := a % 400
	if b == 0 && c != 0 || d == 0 {
		fmt.Println("YES")
	} else {
		fmt.Println("NO")
	}
}

/*
Напишите программу, которая по введённому возрасту пользователя сообщает,
к какой возрастной группе он относится:

до 13 включительно – детство;
от 14 до 24 включительно – молодость;
от 25 до 59 включительно – зрелость;
от 60 – старость.
Формат входных данных
На вход программе подаётся одно целое число – возраст пользователя.

Формат выходных данных
Программа должна вывести название возрастной группы.
*/
func testIf16() {
	var a int
	fmt.Scan(&a)
	if a <= 13 {
		fmt.Println("детство")
	} else if a >= 14 && a <= 24 {
		fmt.Println("молодость")
	} else if a >= 25 && a <= 59 {
		fmt.Println("зрелость")
	} else {
		fmt.Println("старость")
	}
}

/*
Требуется определить, бьет ли ладья,
стоящая на клетке с указанными координатами (номер строки и номер столбца),
фигуру, стоящую на другой указанной клетке.

Входные данные
Вводятся четыре числа: координаты ладьи (два числа) и
координаты другой фигуры (два числа), каждое число вводится в отдельной строке.
Координаты — целые числа в интервале от 1 до 8.

Выходные данные
Требуется вывести слово "YES",
если ладья сможет побить фигуру за 1 ход и "NO" — в противном случае.
*/
func testIf17() {
	var x1, y1, x2, y2 int
	fmt.Scan(&x1, &y1, &x2, &y2)
	if x1 == x2 || y1 == y2 {
		fmt.Println("YES")
	} else {
		fmt.Println("NO")
	}
}

/*
Требуется определить, бьет ли слон,
стоящий на клетке с указанными координатами (номер строки и номер столбца),
фигуру, стоящую на другой указанной клетке.

Входные данные
Вводятся четыре числа: координаты слона и координаты другой фигуры.
Координаты — целые числа в интервале от
1 до 8.

Выходные данные
Требуется вывести слово "YES", если слон способен побить фигуру за
1 ход, в противном случае вывести слово "NO".
*/
func testIf18() {
	var x1, y1, x2, y2 float64
	fmt.Scan(&x1, &y1, &x2, &y2)
	a := math.Abs(x2 - x1)
	b := math.Abs(y2 - y1)
	if a == b {
		fmt.Println("YES")
	} else {
		fmt.Println("NO")
	}
}

/*
Известен вес боксера-любителя (целое число). Известно, что вес таков, что боксер может быть отнесён к одной из трех весовых категорий:

Легкий вес – до 60 кг НЕ включительно;
Первый полусредний вес – до 64 кг НЕ включительно;
Полусредний вес – до 69 кг НЕ включительно.
Напишите программу, определяющую, в какой категории будет выступать данный боксер.

Формат входных данных
На вход программе подаётся одно целое число.

Формат выходных данных
Программа должна вывести текст – название весовой категории
*/
func testIf19() {
	var a int
	fmt.Scan(&a)
	if a < 60 {
		fmt.Println("Легкий вес")
	} else {
		if a >= 60 && a < 64 {
			fmt.Println("Первый полусредний вес")
		} else {
			if a >= 64 && a < 69 {
				fmt.Println("Полусредний вес")
			}
		}
	}
}

/*
Определите среди трех целых чисел количество совпадающих.

Входные данные
Даны три целых числа, каждое из которых не превышает 10^6.

Выходные данные
Программа должна вывести одно из чисел:
3 (если все совпадают), 2 (если два совпадают) или 0 (если все числа различны).
*/
func testIf20() {
	var a, b, c int
	fmt.Scan(&a, &b, &c)
	if a == b && b == c && a == c {
		fmt.Println("3")
	} else {
		if a == b || a == c || b == c {
			fmt.Println("2")
		} else {
			if a != b && b != c && c != a {
				fmt.Println("0")
			}
		}
	}
}

/*
По координатам точки определите принадлежности к одной из координатных четвертей.

Формат входных данных
Вводится два вещественных числа
𝑥 и 𝑦 - координаты точки, каждое из которых по модулю не превышает 10^7

Формат выходных данных
Выведите одно целое число — обозначающее соответствующую четверть, к которой относится.
*/
func testIf21() {
	var x, y float64
	fmt.Scan(&x, &y)
	if x > 0 && y > 0 {
		fmt.Println("1")
	} else if x < 0 && y > 0 {
		fmt.Println("2")
	} else {
		if x < 0 && y < 0 {
			fmt.Println("3")
		} else {
			if x > 0 && y < 0 {
				fmt.Println("4")
			}
		}
	}
}

/*
Напишите программу, которая считывает с клавиатуры два целых числа и строку.
Если эта строка является обозначением одной из четырёх математических операций (+, -, *, / (деление до конца)), то выведите результат применения этой операции к введённым ранее числам,
в противном случае выведите «Неверная операция». Если пользователь захочет поделить на ноль, выведите текст «На ноль делить нельзя!».

Формат входных данных
На вход программе подаются два целых числа, каждое на отдельной строке, и строка.

Формат выходных данных
Программа должна вывести результат применения операции к введенным числам или соответствующий текст, если операция неверная либо если происходит деление на ноль.
*/
func testIf22() {
	var a, b int
	var c string
	fmt.Scan(&a, &b, &c)
	if c == "+" {
		x := a + b
		fmt.Println(x)
	} else if c == "-" {
		x := a - b
		fmt.Println(x)
	} else if c == "/" {
		if b != 0 {
			a := float64(a)
			b := float64(b)
			x := a / b
			fmt.Println(x)
		} else {
			fmt.Println("На ноль делить нельзя!")
		}
	} else if c == "*" {
		x := a * b
		fmt.Println(x)
	} else {
		fmt.Println("Неверная операция")
	}
}

/*
По данному месяцу, определите количество дней в этом месяце.

Входные данные
Вводится одно число - номера месяца, принимающее значения от 1 до 12

Выходные данные
Выведите одно число - количество дней в этом месяце.

Примечание: считайте количество дней в феврале 29
*/
func testIf23() {
	var a int
	fmt.Scan(&a)
	switch a {
	case 1:
		fmt.Println("31")
	case 2:
		fmt.Println("29")
	case 3:
		fmt.Println("31")
	case 4:
		fmt.Println("30")
	case 5:
		fmt.Println("31")
	case 6:
		fmt.Println("30")
	case 7:
		fmt.Println("31")
	case 8:
		fmt.Println("31")
	case 9:
		fmt.Println("30")
	case 10:
		fmt.Println("31")
	case 11:
		fmt.Println("30")
	case 12:
		fmt.Println("31")
	default:
		fmt.Println("Не существует такого месяца")
	}
}

/*
Время года
По данному месяцу, определите в какую пору года попадает этот месяц (Зима, Лето, Весна, Осень).

Входные данные
Вводится одно число - номера месяца, принимающее значения от 1 до 12

Выходные данные
Выведите в какую пору года попадает этот месяц (Зима, Лето, Весна, Осень).
*/
func testIf24() {
	var a int
	fmt.Scan(&a)
	switch a {
	case 1:
		fmt.Println("Зима")
	case 2:
		fmt.Println("Зима")
	case 3:
		fmt.Println("Весна")
	case 4:
		fmt.Println("Весна")
	case 5:
		fmt.Println("Весна")
	case 6:
		fmt.Println("Лето")
	case 7:
		fmt.Println("Лето")
	case 8:
		fmt.Println("Лето")
	case 9:
		fmt.Println("Осень")
	case 10:
		fmt.Println("Осень")
	case 11:
		fmt.Println("Осень")
	case 12:
		fmt.Println("Зима")
	}
}
