package main

import "fmt"

func testInt() {
	testInt1()
	testInt2()
	testInt3()
	testInt4()
	testInt5()
	testInt6()
	testInt7()
	testInt8()

}

/*
По данному целому числу найдите его квадрат.

Формат входных данных
На вход дается одно целое число, по модулю не превосходящее
100
100.

Формат выходных данных
Программа должна вывести квадрат данного числа.
*/
func testInt1() {
	var a int
	fmt.Scan(&a)
	fmt.Println(a * a)
}

/*
Расстояние в километрах
Напишите программу, которая находит полное число километров по заданному числу метров.

Формат входных данных
На вход программе подаётся натуральное число – количество метров.

Формат выходных данных
Программа должна вывести одно число – полное число километров.
*/

func testInt2() {
	var b int
	fmt.Scan(&b)
	fmt.Println(b / 1000)
}

/*
Дано число 𝑥. Вычислите число 𝑥^6 при помощи трех операций умножения.

Формат входных данных
Программа получает на вход одно число 𝑥

Формат выходных данных
Программа должна вывести 𝑥^6 при помощи трех операций.
*/
func testInt3() {
	var x int
	fmt.Scan(&x)
	c := x * x * x
	d := c * c
	fmt.Println(d)
	// put your code here
}

/*
Напишите программу, которая считывает три целых числа и выводит на экран их произведение. Каждое число записано в отдельной строке.

Формат входных данных
На вход программе подаётся три целых числа, каждое на отдельной строке.

Формат выходных данных
Программа должна вывести произведение введенных чисел.
*/
func testInt4() {
	var a int
	var b int
	var c int
	fmt.Scanln(&a)
	fmt.Scanln(&b)
	fmt.Scanln(&c)
	x := a * b * c
	fmt.Println(x)
}

/*
𝑁 школьников делят 𝐾 яблок поровну, неделящийся остаток остается в корзинке. Сколько яблок достанется каждому школьнику?

Формат входных данных
На вход дается два целых положительных числа 𝑁 и 𝐾, каждое из которых не превышает 10000.

Формат выходных данных
Программа должна вывести количество яблок, которое достанется каждому школьнику.
*/
func testInt5() {
	var N, K int
	fmt.Scan(&N, &K)
	z := K / N
	fmt.Println(z)
}

/*
𝑁 школьников делят 𝐾 яблок поровну, неделящийся остаток остается в корзинке. Сколько яблок останется в корзинке?
 Формат входных данных
 На вход дается два целых положительных числа 𝑁 и 𝐾, каждое из которых не превышает 10000.

 Формат выходных данных
 Программа должна вывести искомое количество яблок.
*/

func testInt6() {
	var N, K uint16
	fmt.Scan(&N, &K)
	y := K % N
	fmt.Println(y)
}

/*
Напишите программу вывода на экран трех последовательно идущих чисел, каждое на отдельной строке.
Первое число вводит пользователь, остальные числа вычисляются в программе.

Формат входных данных
На вход программе подается одно целое число.

Формат выходных данных
Программа должна вывести три последовательно идущих числа в соответствии с условием задачи.
*/

func testInt7() {
	var a int
	fmt.Scan(&a)
	b := a
	b++
	c := b
	c++
	fmt.Println(a)
	fmt.Println(b)
	fmt.Println(c)
}

/*
Напишите программу, которая считает стоимость трех телефонов, состоящих из самого устройства, чехла, зарядки и наушников.

Формат входных данных
На вход программе подаётся четыре целых числа, каждое на отдельной строке.
В первой строке — стоимость самого устройства, во второй строке — стоимость чехла,
в третьей строке — стоимость зарядки и в четвертой строке — стоимость наушников.

Формат выходных данных
Программа должна вывести одно число – стоимость покупки (трех телефонов).
*/
func testInt8() {
	var a, b, c, d int
	fmt.Scan(&a, &b, &c, &d)
	S := 3 * (a + b + c + d)
	fmt.Println(S)
}
