package main

import (
	"bufio"
	"fmt"
	"os"
)

func testVvod() {
	testVvod1()
	testVvod2()
	testVvod3()
	testVvod4()
	testVvod5()
}

/*
Приветствие
На вход программе подается строка текста – имя человека. Напишите программу,
которая выводит на экран приветствие в виде слова «Привет» (без кавычек),
после которого должна стоять запятая и пробел, а затем введенное имя.

Формат входных данных
На вход программе подаётся одна строка — имя человека.

Формат выходных данных
Программа должна вывести текст в соотвествии с условием задачи.
*/
func testVvod1() {
	var name string
	fmt.Scan(&name)
	fmt.Println("Привет, " + name)
}

/*
На вход программе подается строка текста – название книги.
Напишите программу, которая повторяет ее на экране со словами «- лучшая книга!» (без кавычек).

Формат входных данных
На вход программе подается название книги.

Формат выходных данных
Программа должна вывести текст согласно условиям задачи.
*/
func testVvod2() {
	scanner := bufio.NewScanner(os.Stdin)
	_ = scanner.Scan()
	name := scanner.Text()
	fmt.Println(name + " - лучшая книга!")
}

/*
Напишите программу, которая считывает три строки по очереди,
а затем выводит их в той же последовательности, каждую на отдельной строчке.

Формат входных данных
На вход программе подаются три строки, каждая на отдельной строке.

Формат выходных данных
Программа должна вывести введенные строки в той же последовательности, каждую на отдельной строке.
*/
func testVvod3() {
	scanner := bufio.NewScanner(os.Stdin)
	_ = scanner.Scan()
	name := scanner.Text()
	_ = scanner.Scan()
	name1 := scanner.Text()
	_ = scanner.Scan()
	name2 := scanner.Text()
	fmt.Println(name)
	fmt.Println(name1)
	fmt.Println(name2)
}

/*
Напишите программу, которая считывает три строки по очереди,
а затем выводит их в обратной последовательности, каждую на отдельной строчке.

Формат входных данных
На вход программе подается три строки, каждая на отдельной строке.

Формат выходных данных
Программа должна вывести введенные строки в обратной последовательности, каждую на отдельной строке.
*/

func testVvod4() {
	scanner := bufio.NewScanner(os.Stdin)
	_ = scanner.Scan()
	name := scanner.Text()
	_ = scanner.Scan()
	name1 := scanner.Text()
	_ = scanner.Scan()
	name2 := scanner.Text()
	fmt.Println(name2)
	fmt.Println(name1)
	fmt.Println(name)
}

/*
Напишите программу, которая считывает строку-разделитель и три строки, а затем выводит указанные строки через разделитель.

Формат входных данных
На вход программе подаётся строка-разделитель и три строки, каждая на отдельной строке.

Формат выходных данных
Программа должна вывести введённые три строки через разделитель.
*/

func testVvod5() {
	scanner := bufio.NewScanner(os.Stdin)
	_ = scanner.Scan()
	name := scanner.Text()
	_ = scanner.Scan()
	name1 := scanner.Text()
	_ = scanner.Scan()
	name2 := scanner.Text()
	_ = scanner.Scan()
	name3 := scanner.Text()
	fmt.Println(name1 + name + name2 + name + name3)
}
